import React, { Component } from "react";
import PropTypes from "prop-types";

class More extends Component {
  constructor(props) {
    super(props);

    this.state = {
      more: "",
    };
  }

  componentWillMount() {
    const { steps } = this.props;
    console.log(this.props);
    const { more } = steps;

    this.setState({
      more,
    });
  }

  render() {
    const { more } = this.state;
    let txt = ''
    if (more.value == "โคโรนา") {
      txt =
        'ไวรัสโคโรนาสายพันธุ์ใหม่ (CoV)เป็นไวรัสโคโรนาสายพันธุ์ใหม่ที่ยังไม่เคยระบุในมนุษย์มาก่อนมนุษย์สามารถติดเชื้อโคโรนาไวรัสสายพันธุ์ใหม่จากสัตว์ได้หรือไม่?การตรวจสอบโดยละเอียดพบว่า SARS-CoV ถูกถ่ายทอดจากแมวชะมดไปสู่คนในประเทศจีนในปี 2545 และ MERS-CoV จากอูฐหนอกสู่คนในซาอุดีอาระเบียในปี 2555 โคโรนาไวรัสที่เป็นที่รู้จักหลายชนิดกำลังแพร่กระจายในสัตว์ที่ยังไม่ติดเชื้อในมนุษย์เมื่อการเฝ้าระวังดีขึ้นทั่วโลกจึงมีแนวโน้มที่จะระบุโคโรนาไวรัสได้มากขึ้น'
      
    }
    else if(more.value == "โควิดรักษาได้ไหม"){
        txt = 'ยังไม่มีข้อมูลแน่ชัด ขึ้นอยู่กับอาการของแต่ละคนจ้า'
    }
    else if(more.value == "วิธีการรักษาโควิด"){
        txt = 'แพทย์จะรักษาตามอาการ'
    }
    else if (more.value == "ยาที่ใช้รักษาโควิด"){
        txt = 'ยาต้านไวรัสเอดส์ ใช้ร่วมกับยาต้านไข้หวัดใหญ่ ยาต้านไข้มาลาเรีย ยา Favilavir'
    }
    else if(more.value == "ใช้เวลารักษานานไหม"){
        txt = 'ขึ้นอยู่กับ อายุ เพศ และโรคประจำตัวของคนไข้จ้า'
    }
    else if(more.value == "โควิดรักษาแล้วมีโอกาสกลับมาเป็นอีกไหม"){
        txt = 'ยังไม่สามารถสรุปได้จ้า ว่าถ้าติดเชื้อแล้วจะติดซ้ำอีก แต่มีโอกาสมากที่จะกลับมาเป็นอีกน้า'
    }
    else if(more.value == "ตรวจโควิดได้ที่ไหนบ้าง"){
        txt = 'โรงพยาบาลของรัฐ  - สถาบันบำราศนราดูร ค่าใช้จ่ายประมาณ 2,500 บาท สถาบันป้องกันควบคุมโรคเขตเมือง กรมควบคุมโรค (สปคม.) 2,700 บาท  โรงพยาบาลจุฬาลงกรณ์ ค่าใช้จ่ายประมาณ 3,000-6,000 บาท (ไม่มีอาการ ไม่รับตรวจ) โรงพยาบาลราชวิถี ค่าใช้จ่ายประมาณ 3,000-6,000 บาท โรงพยาบาลรามาธิบดี ค่าใช้จ่ายประมาณ 5,000 บาท โรงพยาบาลศิริราช ปิยมหาราชการุณย์ ค่าใช้จ่ายประมาณ 9,900 บาท'
    }
    else if(more.value == "โรงพยาบาลไหนค่าตรวจถูกสุด"){
        txt = 'สถาบันบำราศนราดูร ค่าใช้จ่ายประมาณ 2,500 บาท'
    }
    else if(more.value == "โรงพยาบาลไหนแพงสุด"){
        txt = 'โรงพยาบาลศิริราช ปิยมหาราชการุณย์ ค่าใช้จ่ายประมาณ 9,900 บาท'
    }
    else if(more.value == "โรงพยาบาลที่ตรวจฟรี"){
        txt = 'ไม่มีที่ไหนตรวจฟรีจ้าาาา'
    }
    else if(more.value == "โรงพยาบาลไหนที่มีคนใช้เยอะสุด"){
        txt = 'สถาบันบำราศนราดูร ค่าใช้จ่ายประมาณ 2,500 บาท'
    }
    else if(more.value == "สัตว์ติดโควิดได้ไหม"){
        txt = 'ไม่ต้องเครียดจ้าเพราะโคโรนาไวรัสในสัตว์เลี้ยงจะไม่แพร่เชื้อมาสู่คน เพราะเชื้อโคโรนาไวรัสในสัตว์เลี้ยงไม่สามารถติดต่อข้ามสายพันธุ์ได้'
    }
    else if(more.value == "โควิดแพร่จากคนสู่สัตว์ได้ไหม"){
        txt = 'แพร่ไม่ได้จ้า ไม่ต้องห่วง'
    }
    else if(more.value == "วิธีป้องกันโควิด"){
        txt = 'ล้างมือให้บ่อยๆแล้วเว้นระยะห่างทางสังคมเลี่ยงการสัมผัสตาจมูกและปากอย่าลืมปิดปากและจมูกเมื่อจามหรือไอและถ้ามีไข้ไอและหายใจลำบากให้พบแพทย์ทันที เลี่ยงการเดินทางไปที่แออัดด้วยเลี่ยงการใกล้ชิดกับสัตว์ใส่ใจเรื่องการทานอาหารรักษาสุขภาพให้ดีอยู่เสมอค่ะ'
    }
    else if(more.value == "ประเทศไหนติดโควิดมากสุด"){
        txt = 'มีสหรัฐอเมริกายังเป็นประเทศที่พบผู้ติดเชื้อสะสมมากที่สุดในโลก (4,099,884 ราย) ตามมาด้วยบราซิล (2,227,514 ราย) แล้วก็อินเดีย (1,239,684 ราย) ไม่พ้นรัสเซีย (789,190 ราย) และสุดท้ายแอฟริกาใต้ (394,948 ราย) อย่าได้ไปประเทศพวกนี้เชียว พักก่อน!'
    }
    else if(more.value == "ประเทศไทยโควิด"){
        txt = 'สบายๆเพราะที่ไทยตอนนี้ขึ้นชื่อว่ารั้งอันดับ1ของโลก ประเทศที่ฟื้นตัวจากโควิด-19 ได้ดีที่สุดจากThe Global COVID-19 Index (GCI)ที่ได้จัดคะแนนดัชนีและอันดับให้ประเทศไทยเป็นประเทศที่ฟื้นตัวจากโควิด-19 เป็นอันดับ 1 จาก184ประเทศทั่วโลกแต่อย่านิ่งนอนใจล่ะอะไรก็เกิดขึ้นได้ต้องปลอดภัยไว้ก่อนนะคะ'
    }
    else if(more.value == "ประเทศที่มีวัคซีน"){
        txt = 'มีแล้วค่ะตอนนี้ ใช้จริงๆอยู่ 3 ประเทศ มี 1. จีน 2. รัสเซีย 3. สหรัฐอาหรับเอมิเรตส์ หรือ ดูไบ '
    }
    else if(more.value == "วัคซีนโควิด"){
        txt = 'วัคซีนเหล่านี้นำมาใช้งานๆจริงแม้ว่าจะยังวิจัยไม่สมบูรณ์ก็เถอะมี วัคซีน ็Ad5-nCoVิกับ วัคซีน ็CoronaVacิใช้ที่จีน วัคซีน ็Sputnik-V ิกับ วัคซีน ็EpiVacCoronaิใช้ที่รัสเซีย และวัคซีนชนิด Inactivated (ยังไม่ตั้งชื่อ) ใช้งานที่ดูไบ ค่ะ'
    }
    else if(more.value == "ราคาวัคซีนไทย"){
        txt = 'ที่ไทยนั้น นพ.สิริฤกษ์ ทรงศิวิไล เลขาธิการคณะกรรมการวิจัยแห่งชาติ (วช.) กระทรวงการอุดมศึกษา วิทยาศาสตร์ วิจัยและนวัตกรรม (อว.) ระบุว่าราคาวัคซีนโควิด 19 คาดว่าราคาอยู่ที่เข็มละ 632 บาท ฉีด 2 เข็ม ต้นปี 64 สามารถเริ่มใช้ได้แล้วค่ะ'
    }
    else if(more.value == "โควิดติดต่อกันง่ายแค่ไหน"){
        txt = 'ติดง่ายมาก ผ่านทางเดินหายใจ '
    }
    else if(more.value == "กักตัวควรเตรียมตัวอย่างไร"){
        txt = 'คุณควรเตรียมใจเตรียมอาหารและNetflixให้พร้อมค่ะ555'
    }
    else if(more.value == "จำเป็นต้องกักตัว14วันไหม"){
        txt = 'จำเป็นต้องกักตัวถ้าคุณเป็นบุคคลเสี่ยงหรือมีอาการเสี่ยงที่จะเป็นโควิด19ค่ะ'
    }
    else if(more.value == "อาการร้ายแรงของโควิด"){
        txt = 'อาการรุนแรงจะเป็นประมาณนี้ค่ะจะหายใจลำบากหรือหายใจถี่มีเจ็บหน้าอกหรือแน่นหน้าอกและสูญเสียความสามารถในการพูดและเคลื่อนไหว'
    }
    else if(more.value == "ผู้ป่วยโควิดที่ไม่แสดงอาการ"){
        txt = 'ขึ้นอยู่กับภูมิต้านทานของร่างกายแต่ละคนสามารถสร้างแอนติบอดี้มายังยั้งได้ค่ะ ทำให้คนที่ติดเชื้อไม่แสดงอาการ'
    }
    else if(more.value == "ไข้หวัดธรรมดากับโควิดแตกต่างกันยังไง"){
        txt = 'ด้วยความที่อาการของทั้ง2โรคนี้คล้ายกันจึงทำให้สับสนค่ะ แต่สามารถสังเกตเองได้จากถ้าไข้หวัดธรรมดา4-5ก็จะหายแล้วค่ะ'
    }
    else if(more.value == "ความรุนแรงของโรคโควิด"){
        txt = 'ความรุนแรงที่เกิดอาจพบอาการปอดอักเสบอันนำไปสู่การเสียชีวิตเลยค่ะ'
    }
    else {
      txt ='ยังไม่พบข้อมูลค่ะ'
    }

    return <div style={{ width: "100%" }}>{txt}</div>;
  }
}

More.propTypes = {
  steps: PropTypes.object,
};

More.defaultProps = {
  steps: undefined,
};

export default More;
