import React from "react";

export default function Other3() {
  return (
    <div>
      <h3>การรักษาโควิด</h3>
      <p>การดูแลตนเอง</p>
      หากรู้สึกไม่สบาย คุณควรพักผ่อน ดื่มน้ำมากๆ และรับประทานอาหารที่มีประโยชน์
      กักตัวเองในห้องแยกจากสมาชิกครอบครัวคนอื่นๆ และใช้ห้องน้ำแยก
      เมื่ออยู่ที่บ้าน ทุกคนควรทำกิจวัตรประจำวันที่ดีต่อสุขภาพ
      โดยการรับประทานอาหารที่มีประโยชน์ นอนหลับให้เพียงพอ ออกกำลังกายเป็นประจำ
      เด็กๆ
      ต้องการความรักและการเอาใจใส่เป็นพิเศษจากผู้ใหญ่ในช่วงเวลาที่ยากลำบากนี้
      ความรู้สึกเศร้า ตึงเครียด หรือสับสนเป็นเรื่องปกติในช่วงวิกฤต
      การพูดคุยกับคนที่ไว้ใจ เช่น เพื่อนหรือครอบครัวช่วยแก้ปัญหาเหล่านี้ได้
      แต่หากรู้สึกเป็นกังวลมาก
      โปรดติดต่อพูดคุยกับบุคลากรทางการแพทย์หรือนักจิตวิทยาการปรึกษา
    </div>
  );
}
