import React from "react";

export default function Other1() {
  
  return (
    <div>
     <h3>วิธีการป้องกันโควิด</h3>
      <table border="1" style={{ borderCollapse: 'collapse'}}>
          <tbody>
            <tr>
              <td>*</td>
              <td>วิธีป้องกันการแพร่ระบาดของโควิด-19 ล้างมือบ่อยๆ โดยใช้สบู่และน้ำ หรือเจลล้างมือที่มีส่วนผสมหลักเป็นแอลกอฮอล์</td>
            </tr>
            <tr>
              <td>*</td>
              <td>รักษาระยะห่างที่ปลอดภัยจากผู้ที่ไอหรือจาม</td>
            </tr>
            <tr>
              <td>*</td>
              <td>สวมหน้ากากอนามัยเมื่อเว้นระยะห่างไม่ได้ ไม่สัมผัสตา จมูก หรือปาก</td>
            </tr>
            <tr>
              <td>*</td>
              <td>ปิดจมูกและปากด้วยข้อพับด้านในข้อศอกหรือกระดาษชำระเมื่อไอหรือจาม</td>
            </tr>
            <tr>
              <td>*</td>
              <td>เก็บตัวอยู่บ้านเมื่อรู้สึกไม่สบาย หากมีไข้ ไอ และหายใจลำบากโปรดไปพบแพทย์</td>
            </tr>
          </tbody>
        </table>
    </div>
  );
}
