import React from "react";

export default function Other2() {
  return (
    <div>
      <h3>โรงพยาบาลที่รับตรวจโควิด</h3>
      <table border="1" style={{ borderCollapse: "collapse" }}>
        <tbody>
          <tr>
            <td>*</td>
            <td>
            สถาบันบำราศนราดูร ค่าใช้จ่ายประมาณ 2,500 บาท 
            </td>
          </tr>
          <tr>
            <td>*</td>
            <td>สถาบันป้องกันควบคุมโรคเขตเมือง 2,700 บาท</td>
          </tr>
          <tr>
            <td>*</td>
            <td>
            โรงพยาบาลจุฬาลงกรณ์ ค่าใช้จ่ายประมาณ 3,000-6,000 บาท (ไม่มีอาการ ไม่รับตรวจ) ไม่สัมผัสตา จมูก หรือปาก
            </td>
          </tr>
          <tr>
            <td>*</td>
            <td>
            โรงพยาบาลราชวิถี ค่าใช้จ่ายประมาณ 3,000-6,000 บาท
            </td>
          </tr>
          <tr>
            <td>*</td>
            <td>
            โรงพยาบาลรามาธิบดี ค่าใช้จ่ายประมาณ 5,000 บาท
            </td>
          </tr>
          <tr>
            <td>*</td>
            <td>
            โรงพยาบาลศิริราช ปิยมหาราชการุณย์ ค่าใช้จ่ายประมาณ 9,900 บาท
            </td>
          </tr>
        </tbody>
      </table>
    </div>
  );
}
